app/controllers/api/v1/companies_controller.rb

  def index
    render json: Company.all
---
SELECT "companies".* FROM "companies"

  def show
    render json: { company: Company.find(params[:id])}
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]